Repository: denis-kolchev/Paint-Anytime
Catalog: Shared/Localizable.xcstrings
Source language: en
Languages: ar, cs, da, de, el, es, fi, fr, he, hu, id, it, ja, ko, nb, nl, pl, pt_br, pt_pt, ru, sv, th, tr, uk, vi, zh_hans, zh_hant

source: When you are ready, tap Next.
ar: عندما تكون جاهزًا، اضغط على التالي.
cs: Až budete připraveni, klepněte na Další.
da: Tryk på Næste, når du er klar.
de: Wenn du bereit bist, tippe auf Weiter.
el: Όταν είστε έτοιμοι, πατήστε Επόμενο.
es: Cuando estés listo, toca Siguiente.
fi: Kun olet valmis, napauta Seuraava.
fr: Quand vous êtes prêt, touchez Suivant.
he: כשתהיו מוכנים, הקישו על ״הבא״.
hu: Ha készen állsz, koppints a Tovább gombra.
id: Saat siap, ketuk Berikutnya.
it: Quando sei pronto, tocca Avanti.
ja: 準備ができたら「次へ」をタップしてください。
ko: 준비되면 다음을 누르세요.
nb: Trykk på Neste når du er klar.
nl: Tik op Volgende als je klaar bent.
pl: Gdy będziesz gotowy, stuknij Dalej.
pt_br: Quando estiver pronto, toque em Próximo.
pt_pt: Quando estiver pronto, toque em Seguinte.
ru: Когда будешь готов(а), нажми «Далее».
sv: Tryck på Nästa när du är redo.
th: เมื่อพร้อมแล้ว ให้แตะถัดไป
tr: Hazır olduğunuzda İleri seçeneğine dokunun.
uk: Коли будете готові, натисніть «Далі».
vi: Khi sẵn sàng, hãy chạm Tiếp.
zh_hans: 准备好后，请轻点“下一步”。
zh_hant: 準備好後，請點一下「下一步」。

source: When you choose to share a drawing, the selected image is passed to the app or service you choose in the system sharing interface. That service handles the image under its own terms and privacy policy. The developer does not receive a copy unless you send one to the developer yourself.
ar: عندما تختار مشاركة رسم، تُمرَّر الصورة المحددة إلى التطبيق أو الخدمة التي تختارها من واجهة المشاركة في النظام. تتعامل تلك الخدمة مع الصورة وفقًا لشروطها وسياسة الخصوصية الخاصة بها. لا يتلقى المطوّر نسخة إلا إذا أرسلتها إليه بنفسك.
cs: Když se rozhodnete sdílet kresbu, vybraný obrázek je předán aplikaci nebo službě zvolené v systémovém rozhraní sdílení. Tato služba zpracovává obrázek podle vlastních podmínek a zásad ochrany soukromí. Vývojář nedostane kopii, pokud mu ji sami nepošlete.
da: Når du vælger at dele en tegning, overføres det valgte billede til den app eller tjeneste, du vælger i systemets delingsmenu. Tjenesten behandler billedet efter sine egne vilkår og sin egen privatlivspolitik. Udvikleren modtager ikke en kopi, medmindre du selv sender en til udvikleren.
de: Wenn du eine Zeichnung teilst, wird das ausgewählte Bild an die App oder den Dienst übergeben, den du im Teilen-Menü des Systems auswählst. Dieser Dienst verarbeitet das Bild nach seinen eigenen Bedingungen und Datenschutzrichtlinien. Der Entwickler erhält keine Kopie, es sei denn, du sendest ihm selbst eine.
el: Όταν επιλέγετε να κοινοποιήσετε ένα σχέδιο, η επιλεγμένη εικόνα διαβιβάζεται στην εφαρμογή ή υπηρεσία που επιλέγετε στη διεπαφή κοινοποίησης του συστήματος. Η υπηρεσία χειρίζεται την εικόνα σύμφωνα με τους δικούς της όρους και την πολιτική απορρήτου της. Ο προγραμματιστής δεν λαμβάνει αντίγραφο, εκτός αν του το στείλετε εσείς.
es: Cuando decides compartir un dibujo, la imagen seleccionada se entrega a la aplicación o al servicio que elijas en la interfaz de compartir del sistema. Ese servicio trata la imagen según sus propias condiciones y política de privacidad. El desarrollador no recibe una copia a menos que se la envíes tú mismo.
fi: Kun jaat piirroksen, valittu kuva välitetään sovellukseen tai palveluun, jonka valitset järjestelmän jakonäkymässä. Palvelu käsittelee kuvaa omien ehtojensa ja tietosuojakäytäntönsä mukaisesti. Kehittäjä ei saa kopiota, ellet itse lähetä sitä hänelle.
fr: Lorsque vous choisissez de partager un dessin, l’image sélectionnée est transmise à l’application ou au service choisi dans l’interface de partage du système. Ce service traite l’image selon ses propres conditions et sa politique de confidentialité. Le développeur n’en reçoit pas de copie, sauf si vous lui en envoyez une vous-même.
he: בעת בחירה לשתף ציור, התמונה שנבחרה מועברת לאפליקציה או לשירות שנבחרו בממשק השיתוף של המערכת. אותו שירות מטפל בתמונה בהתאם לתנאים ולמדיניות הפרטיות שלו. המפתח אינו מקבל עותק אלא אם בחרת לשלוח לו עותק בעצמך.
hu: Rajz megosztásakor a kijelölt kép a rendszer megosztási felületén kiválasztott alkalmazáshoz vagy szolgáltatáshoz kerül. Az adott szolgáltatás saját feltételei és adatvédelmi szabályzata szerint kezeli a képet. A fejlesztő nem kap másolatot, kivéve, ha Ön közvetlenül küld neki egyet.
id: Saat Anda memilih untuk membagikan gambar, gambar yang dipilih diteruskan ke aplikasi atau layanan yang Anda pilih melalui antarmuka berbagi sistem. Layanan tersebut menangani gambar berdasarkan ketentuan dan kebijakan privasinya sendiri. Pengembang tidak menerima salinan kecuali Anda sendiri mengirimkannya kepada pengembang.
it: Quando scegli di condividere un disegno, l’immagine selezionata viene trasmessa all’app o al servizio che scegli nell’interfaccia di condivisione del sistema. Tale servizio tratta l’immagine secondo i propri termini e la propria informativa sulla privacy. Lo sviluppatore non riceve una copia, a meno che tu non gliela invii personalmente.
ja: 絵の共有を選ぶと、選択した画像はシステムの共有画面で指定したアプリやサービスに渡されます。そのサービスは、独自の利用規約とプライバシーポリシーに従って画像を取り扱います。ご自身で開発者に送信しない限り、開発者がコピーを受け取ることはありません。
ko: 그림을 공유하면 선택한 이미지가 시스템 공유 화면에서 선택한 앱이나 서비스로 전달됩니다. 해당 서비스는 자체 약관 및 개인정보 처리방침에 따라 이미지를 처리합니다. 사용자가 개발자에게 직접 보내지 않는 한 개발자는 사본을 받지 않습니다.
nb: Når du velger å dele en tegning, overføres det valgte bildet til appen eller tjenesten du velger i systemets delingsmeny. Tjenesten behandler bildet etter sine egne vilkår og sin personvernerklæring. Utvikleren mottar ingen kopi med mindre du selv sender en til utvikleren.
nl: Wanneer je een tekening deelt, wordt de geselecteerde afbeelding doorgegeven aan de app of dienst die je in het deelmenu van het systeem kiest. Die dienst verwerkt de afbeelding volgens zijn eigen voorwaarden en privacybeleid. De ontwikkelaar ontvangt geen kopie, tenzij je die zelf naar hem stuurt.
pl: Gdy udostępniasz rysunek, wybrany obraz jest przekazywany do aplikacji lub usługi wskazanej w systemowym interfejsie udostępniania. Ta usługa przetwarza obraz zgodnie z własnymi warunkami i polityką prywatności. Deweloper nie otrzymuje kopii, chyba że samodzielnie mu ją wyślesz.
pt_br: Quando você compartilha um desenho, a imagem selecionada é enviada ao aplicativo ou serviço escolhido na interface de compartilhamento do sistema. Esse serviço trata a imagem segundo seus próprios termos e política de privacidade. O desenvolvedor não recebe uma cópia, a menos que você a envie diretamente a ele.
pt_pt: Quando decide partilhar um desenho, a imagem selecionada é transmitida à aplicação ou ao serviço escolhido na interface de partilha do sistema. Esse serviço trata a imagem segundo os seus próprios termos e política de privacidade. O programador não recebe uma cópia, a menos que lha envie diretamente.
ru: Когда вы делитесь рисунком, выбранное изображение передаётся приложению или сервису, выбранному в системном меню отправки. Этот сервис обрабатывает изображение согласно своим условиям и политике конфиденциальности. Разработчик не получает копию, если вы сами не отправите её ему.
sv: När du väljer att dela en teckning överförs den valda bilden till den app eller tjänst du väljer i systemets delningsmeny. Den tjänsten hanterar bilden enligt sina egna villkor och sin integritetspolicy. Utvecklaren får ingen kopia om du inte själv skickar en till utvecklaren.
th: เมื่อคุณเลือกแชร์ภาพวาด ภาพที่เลือกจะถูกส่งไปยังแอปหรือบริการที่คุณเลือกในหน้าจอแชร์ของระบบ บริการนั้นจัดการภาพตามข้อกำหนดและนโยบายความเป็นส่วนตัวของตน ผู้พัฒนาจะไม่ได้รับสำเนาเว้นแต่คุณจะส่งให้ผู้พัฒนาด้วยตนเอง
tr: Bir çizimi paylaşmayı seçtiğinizde, seçili görüntü sistemin paylaşım arayüzünde seçtiğiniz uygulama veya hizmete aktarılır. Bu hizmet görüntüyü kendi koşulları ve gizlilik politikası kapsamında işler. Siz doğrudan göndermedikçe geliştirici bir kopya almaz.
uk: Коли ви поширюєте малюнок, вибране зображення передається застосунку або сервісу, який ви обираєте в системному меню поширення. Цей сервіс обробляє зображення за власними умовами й політикою конфіденційності. Розробник не отримує копії, якщо ви самі її йому не надішлете.
vi: Khi bạn chọn chia sẻ một bản vẽ, hình ảnh đã chọn được chuyển đến ứng dụng hoặc dịch vụ bạn chọn trong giao diện chia sẻ của hệ thống. Dịch vụ đó xử lý hình ảnh theo điều khoản và chính sách quyền riêng tư riêng. Nhà phát triển không nhận bản sao trừ khi bạn tự gửi cho nhà phát triển.
zh_hans: 当您选择分享画作时，所选图像会传递给您在系统分享界面中选择的应用或服务。该服务会按照其自身的条款和隐私政策处理图像。除非您主动发送给开发者，否则开发者不会收到副本。
zh_hant: 當您選擇分享畫作時，所選影像會傳送至您在系統分享介面中選擇的 App 或服務。該服務會依其自身條款與隱私權政策處理影像。除非您主動傳送給開發者，否則開發者不會收到副本。

source: Where the iPhone photo-transfer feature is available, drawings you choose to transfer are sent from your Apple Watch to the companion iPhone app using Apple's WatchConnectivity framework. The iPhone app requests permission to add images to Photos; it does not request access to read your existing photo library. Received images are kept in a local queue until successfully saved to Photos, after which the app removes the queued copy. If permission is denied or saving fails, images can remain queued locally.
ar: حيثما تتوفر ميزة نقل الصور إلى iPhone، تُرسَل الرسومات التي تختار نقلها من Apple Watch إلى التطبيق المصاحب على iPhone باستخدام إطار عمل WatchConnectivity من Apple. يطلب تطبيق iPhone إذنًا لإضافة الصور إلى «الصور»؛ ولا يطلب صلاحية قراءة مكتبة صورك الحالية. تبقى الصور المستلمة في قائمة انتظار محلية إلى أن تُحفَظ بنجاح في «الصور»، وبعد ذلك يحذف التطبيق النسخة من قائمة الانتظار. إذا رُفض الإذن أو فشل الحفظ، فقد تبقى الصور في قائمة الانتظار المحلية.
cs: Pokud je dostupný přenos fotek na iPhone, vybrané kresby se odesílají z Apple Watch do doprovodné aplikace pro iPhone pomocí frameworku WatchConnectivity společnosti Apple. Aplikace pro iPhone žádá o oprávnění přidávat obrázky do Fotek; nežádá o přístup ke čtení vaší stávající knihovny fotek. Přijaté obrázky zůstávají v místní frontě do úspěšného uložení do Fotek, poté aplikace kopii z fronty odstraní. Pokud je oprávnění zamítnuto nebo ukládání selže, obrázky mohou zůstat v místní frontě.
da: Hvor funktionen til fotooverførsel til iPhone er tilgængelig, sendes de valgte tegninger fra dit Apple Watch til den tilhørende iPhone-app via Apples WatchConnectivity-framework. iPhone-appen beder om tilladelse til at føje billeder til Fotos; den beder ikke om læseadgang til dit eksisterende fotobibliotek. Modtagne billeder gemmes i en lokal kø, indtil de er gemt i Fotos, hvorefter appen fjerner kopien fra køen. Hvis tilladelsen afvises, eller lagringen mislykkes, kan billederne blive i den lokale kø.
de: Soweit die Fotoübertragung auf das iPhone verfügbar ist, werden ausgewählte Zeichnungen mithilfe von Apples WatchConnectivity-Framework von deiner Apple Watch an die zugehörige iPhone-App gesendet. Die iPhone-App bittet um Erlaubnis, Bilder zu Fotos hinzuzufügen; sie fordert keinen Lesezugriff auf deine bestehende Fotomediathek an. Empfangene Bilder bleiben in einer lokalen Warteschlange, bis sie erfolgreich in Fotos gespeichert wurden. Anschließend entfernt die App die Kopie aus der Warteschlange. Wird die Erlaubnis verweigert oder schlägt das Speichern fehl, können die Bilder lokal in der Warteschlange verbleiben.
el: Όπου είναι διαθέσιμη η μεταφορά φωτογραφιών στο iPhone, τα σχέδια που επιλέγετε αποστέλλονται από το Apple Watch στη συνοδευτική εφαρμογή για iPhone μέσω του πλαισίου WatchConnectivity της Apple. Η εφαρμογή iPhone ζητά άδεια προσθήκης εικόνων στις Φωτογραφίες· δεν ζητά πρόσβαση ανάγνωσης στην υπάρχουσα βιβλιοθήκη φωτογραφιών σας. Οι ληφθείσες εικόνες παραμένουν σε τοπική ουρά μέχρι να αποθηκευτούν επιτυχώς στις Φωτογραφίες και κατόπιν η εφαρμογή αφαιρεί το αντίγραφο από την ουρά. Αν η άδεια απορριφθεί ή η αποθήκευση αποτύχει, οι εικόνες μπορεί να παραμείνουν στην τοπική ουρά.
es: Cuando está disponible la función de transferencia de fotos al iPhone, los dibujos que eliges transferir se envían desde el Apple Watch a la aplicación complementaria del iPhone mediante el framework WatchConnectivity de Apple. La aplicación para iPhone solicita permiso para añadir imágenes a Fotos; no solicita acceso de lectura a tu fototeca existente. Las imágenes recibidas se mantienen en una cola local hasta que se guardan correctamente en Fotos, tras lo cual la aplicación elimina la copia de la cola. Si se deniega el permiso o falla el guardado, las imágenes pueden permanecer en la cola local.
fi: Kun kuvien siirtäminen iPhoneen on käytettävissä, valitsemasi piirrokset lähetetään Apple Watchista iPhone-kumppanisovellukseen Applen WatchConnectivity-kehyksen avulla. iPhone-sovellus pyytää lupaa lisätä kuvia Kuvat-sovellukseen; se ei pyydä lukuoikeutta olemassa olevaan kuvakirjastoosi. Vastaanotetut kuvat säilyvät paikallisessa jonossa, kunnes ne on tallennettu onnistuneesti Kuviin. Sen jälkeen sovellus poistaa jonossa olevan kopion. Jos lupa evätään tai tallentaminen epäonnistuu, kuvat voivat jäädä paikalliseen jonoon.
fr: Lorsque le transfert de photos vers l’iPhone est disponible, les dessins que vous choisissez de transférer sont envoyés de votre Apple Watch à l’application compagnon pour iPhone via le framework WatchConnectivity d’Apple. L’application iPhone demande l’autorisation d’ajouter des images à Photos, mais pas de lire votre photothèque existante. Les images reçues sont conservées dans une file d’attente locale jusqu’à leur enregistrement réussi dans Photos, puis l’application supprime la copie en attente. Si l’autorisation est refusée ou si l’enregistrement échoue, les images peuvent rester dans la file d’attente locale.
he: כאשר תכונת העברת התמונות ל-iPhone זמינה, הציורים שנבחרו להעברה נשלחים מה-Apple Watch לאפליקציה הנלווית ב-iPhone באמצעות מסגרת WatchConnectivity של Apple. אפליקציית ה-iPhone מבקשת הרשאה להוסיף תמונות ל״תמונות״; היא אינה מבקשת גישת קריאה לספריית התמונות הקיימת שלך. התמונות שהתקבלו נשמרות בתור מקומי עד לשמירתן בהצלחה ב״תמונות״, ולאחר מכן האפליקציה מסירה את העותק מהתור. אם ההרשאה נדחית או השמירה נכשלת, התמונות עשויות להישאר בתור המקומי.
hu: Ahol elérhető az iPhone-ra történő képátvitel, a kiválasztott rajzok az Apple Watchról az iPhone-társalkalmazásba kerülnek az Apple WatchConnectivity keretrendszerével. Az iPhone-alkalmazás engedélyt kér képek hozzáadására a Fotókhoz; nem kér olvasási hozzáférést a meglévő fotókönyvtárhoz. A fogadott képek helyi várólistán maradnak, amíg sikeresen a Fotókba nem mentődnek; ezután az alkalmazás törli a várólistán lévő másolatot. Ha az engedélyt megtagadják vagy a mentés sikertelen, a képek a helyi várólistán maradhatnak.
id: Jika fitur transfer foto ke iPhone tersedia, gambar yang Anda pilih untuk ditransfer dikirim dari Apple Watch ke aplikasi pendamping iPhone menggunakan kerangka kerja WatchConnectivity milik Apple. Aplikasi iPhone meminta izin menambahkan gambar ke Foto; aplikasi tidak meminta akses untuk membaca perpustakaan foto yang sudah ada. Gambar yang diterima disimpan dalam antrean lokal hingga berhasil disimpan ke Foto, lalu aplikasi menghapus salinan dalam antrean. Jika izin ditolak atau penyimpanan gagal, gambar dapat tetap berada dalam antrean lokal.
it: Dove è disponibile il trasferimento di foto su iPhone, i disegni che scegli di trasferire vengono inviati dall’Apple Watch all’app complementare per iPhone tramite il framework WatchConnectivity di Apple. L’app per iPhone richiede l’autorizzazione ad aggiungere immagini a Foto; non richiede accesso in lettura alla libreria fotografica esistente. Le immagini ricevute restano in una coda locale fino al corretto salvataggio in Foto, dopodiché l’app rimuove la copia dalla coda. Se l’autorizzazione viene negata o il salvataggio non riesce, le immagini possono restare nella coda locale.
ja: iPhoneへの写真転送機能が利用できる場合、転送対象として選んだ絵は、AppleのWatchConnectivityフレームワークを通じてApple WatchからiPhoneコンパニオンアプリに送られます。iPhoneアプリは「写真」に画像を追加する許可を求めますが、既存の写真ライブラリを読み取るためのアクセスは求めません。受信した画像は「写真」への保存が成功するまでローカルの待機キューに保持され、保存後にアプリがキュー内のコピーを削除します。許可が拒否された場合や保存に失敗した場合、画像がローカルのキューに残ることがあります。
ko: iPhone 사진 전송 기능을 사용할 수 있는 경우, 전송하도록 선택한 그림은 Apple의 WatchConnectivity 프레임워크를 통해 Apple Watch에서 iPhone 보조 앱으로 전송됩니다. iPhone 앱은 사진 앱에 이미지를 추가할 권한을 요청하지만 기존 사진 보관함을 읽을 수 있는 접근 권한은 요청하지 않습니다. 수신한 이미지는 사진 앱에 성공적으로 저장될 때까지 로컬 대기열에 보관되며, 저장 후 앱이 대기열의 사본을 제거합니다. 권한이 거부되거나 저장에 실패하면 이미지가 로컬 대기열에 남을 수 있습니다.
nb: Der bildeoverføring til iPhone er tilgjengelig, sendes tegningene du velger, fra Apple Watch til den tilhørende iPhone-appen via Apples WatchConnectivity-rammeverk. iPhone-appen ber om tillatelse til å legge til bilder i Bilder; den ber ikke om lesetilgang til det eksisterende bildebiblioteket ditt. Mottatte bilder beholdes i en lokal kø til de er lagret i Bilder. Deretter fjerner appen kopien fra køen. Hvis tillatelsen avslås eller lagringen mislykkes, kan bildene bli liggende i den lokale køen.
nl: Waar foto-overdracht naar de iPhone beschikbaar is, worden de gekozen tekeningen via Apples WatchConnectivity-framework van je Apple Watch naar de bijbehorende iPhone-app verstuurd. De iPhone-app vraagt toestemming om afbeeldingen aan Foto’s toe te voegen, maar vraagt geen leestoegang tot je bestaande fotobibliotheek. Ontvangen afbeeldingen blijven in een lokale wachtrij totdat ze succesvol in Foto’s zijn opgeslagen; daarna verwijdert de app de kopie uit de wachtrij. Als toestemming wordt geweigerd of opslaan mislukt, kunnen afbeeldingen in de lokale wachtrij blijven staan.
pl: Jeśli dostępna jest funkcja przesyłania zdjęć na iPhone’a, wybrane rysunki są wysyłane z Apple Watch do towarzyszącej aplikacji na iPhone’a za pomocą platformy WatchConnectivity firmy Apple. Aplikacja na iPhone’a prosi o pozwolenie na dodawanie obrazów do Zdjęć; nie prosi o dostęp do odczytu istniejącej biblioteki zdjęć. Odebrane obrazy pozostają w lokalnej kolejce do pomyślnego zapisania w Zdjęciach, po czym aplikacja usuwa kopię z kolejki. Jeśli odmówisz pozwolenia lub zapis się nie powiedzie, obrazy mogą pozostać w lokalnej kolejce.
pt_br: Quando o recurso de transferência de fotos para o iPhone está disponível, os desenhos escolhidos são enviados do Apple Watch ao aplicativo complementar para iPhone usando o framework WatchConnectivity da Apple. O aplicativo para iPhone solicita permissão para adicionar imagens ao Fotos; não solicita acesso para ler sua fototeca existente. As imagens recebidas ficam em uma fila local até serem salvas com sucesso no Fotos; depois, o aplicativo remove a cópia da fila. Se a permissão for negada ou o salvamento falhar, as imagens poderão permanecer na fila local.
pt_pt: Quando a funcionalidade de transferência de fotografias para o iPhone está disponível, os desenhos escolhidos são enviados do Apple Watch para a aplicação complementar para iPhone através da framework WatchConnectivity da Apple. A aplicação para iPhone pede autorização para adicionar imagens a Fotografias; não pede acesso de leitura à sua fototeca existente. As imagens recebidas ficam numa fila local até serem guardadas com sucesso em Fotografias; depois, a aplicação remove a cópia da fila. Se a autorização for recusada ou a gravação falhar, as imagens podem permanecer na fila local.
ru: Если доступна передача изображений на iPhone, выбранные рисунки отправляются с Apple Watch в сопутствующее приложение для iPhone с помощью платформы Apple WatchConnectivity. Приложение для iPhone запрашивает разрешение добавлять изображения в «Фото», но не запрашивает доступ для чтения существующей медиатеки. Полученные изображения хранятся в локальной очереди до успешного сохранения в «Фото», после чего приложение удаляет копию из очереди. Если разрешение отклонено или сохранение не удалось, изображения могут остаться в локальной очереди.
sv: Där funktionen för bildöverföring till iPhone är tillgänglig skickas valda teckningar från din Apple Watch till den tillhörande iPhone-appen med Apples WatchConnectivity-ramverk. iPhone-appen begär tillstånd att lägga till bilder i Bilder; den begär inte läsåtkomst till ditt befintliga bildbibliotek. Mottagna bilder lagras i en lokal kö tills de har sparats i Bilder. Därefter tar appen bort kopian från kön. Om tillstånd nekas eller sparandet misslyckas kan bilderna bli kvar i den lokala kön.
th: เมื่อมีคุณสมบัติถ่ายโอนรูปภาพไปยัง iPhone ภาพวาดที่คุณเลือกถ่ายโอนจะถูกส่งจาก Apple Watch ไปยังแอปคู่กันบน iPhone ผ่านเฟรมเวิร์ก WatchConnectivity ของ Apple แอป iPhone ขอสิทธิ์เพิ่มภาพลงในรูปภาพ แต่ไม่ขอสิทธิ์อ่านคลังรูปภาพที่มีอยู่ของคุณ ภาพที่ได้รับจะเก็บอยู่ในคิวภายในอุปกรณ์จนกว่าจะบันทึกลงในรูปภาพสำเร็จ จากนั้นแอปจะลบสำเนาออกจากคิว หากไม่ได้รับอนุญาตหรือบันทึกไม่สำเร็จ ภาพอาจยังคงอยู่ในคิวภายในอุปกรณ์
tr: iPhone’a fotoğraf aktarma özelliğinin bulunduğu sürümlerde, aktarmayı seçtiğiniz çizimler Apple’ın WatchConnectivity çerçevesi aracılığıyla Apple Watch’unuzdan eşlik eden iPhone uygulamasına gönderilir. iPhone uygulaması Fotoğraflar’a görüntü eklemek için izin ister; mevcut fotoğraf arşivinizi okumak için erişim istemez. Alınan görüntüler Fotoğraflar’a başarıyla kaydedilene kadar yerel bir kuyrukta tutulur; ardından uygulama kuyruktaki kopyayı siler. İzin reddedilirse veya kaydetme başarısız olursa görüntüler yerel kuyrukta kalabilir.
uk: Якщо доступна функція передавання зображень на iPhone, вибрані малюнки надсилаються з Apple Watch до супутнього застосунку для iPhone через платформу Apple WatchConnectivity. Застосунок для iPhone запитує дозвіл додавати зображення у «Фотографії», але не запитує доступу для читання наявної фототеки. Отримані зображення зберігаються в локальній черзі до успішного збереження у «Фотографії», після чого застосунок видаляє копію з черги. Якщо в дозволі відмовлено або збереження не вдалося, зображення можуть залишитися в локальній черзі.
vi: Khi có tính năng chuyển ảnh sang iPhone, những bản vẽ bạn chọn chuyển sẽ được gửi từ Apple Watch đến ứng dụng đồng hành trên iPhone qua khung WatchConnectivity của Apple. Ứng dụng iPhone xin quyền thêm hình ảnh vào Ảnh; không xin quyền đọc thư viện ảnh hiện có của bạn. Hình ảnh nhận được được giữ trong hàng đợi cục bộ cho đến khi lưu thành công vào Ảnh, sau đó ứng dụng xóa bản sao trong hàng đợi. Nếu quyền bị từ chối hoặc lưu không thành công, hình ảnh có thể vẫn nằm trong hàng đợi cục bộ.
zh_hans: 如果提供向 iPhone 传输照片的功能，您选择传输的画作会通过 Apple 的 WatchConnectivity 框架，从 Apple Watch 发送到配套的 iPhone 应用。iPhone 应用会请求向“照片”添加图像的权限，不会请求读取您现有照片图库的权限。收到的图像会保留在本地队列中，直至成功保存到“照片”，之后应用会移除队列中的副本。如果权限被拒绝或保存失败，图像可能会继续保留在本地队列中。
zh_hant: 若提供傳送照片至 iPhone 的功能，您選擇傳送的畫作會透過 Apple 的 WatchConnectivity 框架，從 Apple Watch 傳送至配套的 iPhone App。iPhone App 會要求將影像加入「照片」的權限，不會要求讀取您現有照片圖庫的權限。收到的影像會保留在本機佇列中，直到成功儲存至「照片」，之後 App 便會移除佇列中的副本。如果權限遭拒或儲存失敗，影像可能會繼續留在本機佇列中。

source: White
ar: أبيض
cs: Bílá
da: Hvid
de: Weiß
el: Λευκό
es: Blanco
fi: Valkoinen
fr: Blanc
he: לבן
hu: Fehér
id: Putih
it: Bianco
ja: 白
ko: 흰색
nb: Hvit
nl: Wit
pl: Biały
pt_br: Branco
pt_pt: Branco
ru: Белый
sv: Vit
th: ขาว
tr: Beyaz
uk: Білий
vi: Trắng
zh_hans: 白色
zh_hant: 白色

source: Width
ar: السُمك
cs: Tloušťka
da: Tykkelse
de: Breite
el: Πάχος
es: Grosor
fi: Paksuus
fr: Épaisseur
he: עובי
hu: Vastagság
id: Ketebalan
it: Spessore
ja: 太さ
ko: 두께
nb: Tykkelse
nl: Dikte
pl: Grubość
pt_br: Espessura
pt_pt: Espessura
ru: Толщина
sv: Tjocklek
th: ความหนา
tr: Kalınlık
uk: Товщина
vi: Độ dày
zh_hans: 粗细
zh_hant: 粗細
